read_verilog -sv design.sv
hierarchy -top baseline_array_multiplier
synth -top baseline_array_multiplier
tee -o output.txt stat